app/views/groups/index.html.slim


      h2.group-name
        .col-md-6.col-md-offset-5
---
SELECT  "groups".* FROM "groups"   ORDER BY "groups"."id" ASC LIMIT 1

      .playlist-container
        - @group.playlists.each do |playlist|
---
SELECT "playlists".* FROM "playlists"  WHERE "playlists"."group_id" = ?  [["group_id", 1]]