app/controllers/groups_controller.rb

SELECT  "groups".* FROM "groups"   ORDER BY "groups"."id" ASC LIMIT 1
---
  def index
    @groups = Group.all