app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"   ORDER BY created_at DESC
---
  def index
    @songs = Song.all.order('created_at DESC')

INSERT INTO "songs" ("created_at", "duration", "link", "name", "playlist_id", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    response.headers["Content-Type"] = "text/javascript"
    playlist_id = Group.find(params[:group_id]).playlist.id
    @song = Song.create(uid: params[:uid], playlist_id: playlist_id)